mistyk/inavradar-ESP32/src/main.cpp
  for(;;) {
    if (String(planeFC) == "INAV" && millis() - statusLastTime > cfg.intervalStatus) {
      if (msp.getActiveModes(&planeModes)) {
        planeState = bitRead(planeModes,0);
        if (xQueueSend(armedQ, ( void * ) &planeState, ( TickType_t ) 0) != pdPASS ) cliLog("armedQ full");
        else cliLog("armedQ sent msg");
        //cliLog("FC: Arm state " + String(pd.state));
      }
      if (msp.request(MSP_ANALOG, &fcanalog, sizeof(fcanalog))) {
        if (xQueueSend(batQ, ( void * ) &fcanalog.vbat, ( TickType_t ) 0) != pdPASS ) cliLog("batQ full");
        else cliLog("batQ sent msg");
        //cliLog("FC: Bat " + String(fcanalog.vbat));
      }
      //if (msp.request(MSP_STATUS_EX, &fcstatusex, sizeof(fcstatusex))) {
        //cliLog("FC: Status EX " + String(bitRead(fcstatusex.armingFlags,18)));
      //}
      statusLastTime = millis();
    }
    if (String(planeFC) == "INAV" && millis() - gpsLastTime > cfg.intervalSend) {
      if (msp.request(MSP_RAW_GPS, &gps, sizeof(gps))) {
        if (xQueueSend(gpsQ, ( void * ) &gps, ( TickType_t ) 0) != pdPASS ) cliLog("gpsQ full");
        else cliLog("gpsQ sent msg");
        //cliLog("FC: GPS " + String(pd.gps.fixType));
      }
      gpsLastTime = millis();
    }

  }
  vTaskDelay(100);
}

void getPlaneData () {
  for (size_t i = 0; i < 5; i++) {
    pd.planeName[i] = (char) random(65,90);
  }
  if (msp.request(MSP_NAME, &pd.planeName, sizeof(pd.planeName))) {
    cliLog("FC: UAV name " + String(pd.planeName));
  }
  String("No FC").toCharArray(planeFC,20);
  if (msp.request(MSP_FC_VARIANT, &planeFC, sizeof(planeFC))) {
    cliLog("FC: Firmware " + String(planeFC));
  }
}

void planeSetPosTask (void * pvParameters) {
  vTaskDelay(10);
  msp_radar_pos_t radarPos;
  for (size_t i = 0; i <= 4; i++) {
    if (pds[i].id != 0) {
      radarPos.id = i;
      radarPos.state = pds[i].pd.state;
      radarPos.lat = pds[i].pd.gps.lat;
      radarPos.lon = pds[i].pd.gps.lon;
      radarPos.alt = pds[i].pd.gps.alt;
      radarPos.speed = pds[i].pd.gps.groundSpeed;
      radarPos.heading = pds[i].pd.gps.groundCourse / 10;
      if (millis() - pds[i].lastUpdate < cfg.intervalSend+100) radarPos.lq =  constrain ( (130 + pds[i].rssi ) , 1 , 100);
      else radarPos.lq = 0;
      msp.command(MSP_SET_RADAR_POS, &radarPos, sizeof(radarPos));
      cliLog("Sent to FC - POI #" + String(i));
    }
  }
  vTaskDelay(100);
  vTaskDelete(NULL);
}
void planeSetPos () {
  xTaskCreatePinnedToCore(planeSetPosTask,"status",10000,NULL,1,&posTask,0);
}

void planeFakePos () {

}

void initMSP () {
  cliLog("Starting MSP ...");
  display.drawString (0, 24, "MSP ");
  display.display();
  delay(200);
  Serial1.begin(57600, SERIAL_8N1, cfg.mspRX , cfg.mspTX);
  msp.begin(Serial1);
  cliLog("MSP started!");
  display.drawString (100, 24, "OK");
  display.display();
  display.drawString (0, 32, "FC ");
  display.display();
  cliLog("Waiting for FC to start ...");
  delay(cfg.fcTimeout*1000);
  getPlaneData();
  xTaskCreatePinnedToCore(mspComms,"msp",10000,NULL,1,&mspTask,0);
  cliLog("FC detected: " + String(planeFC));
  display.drawString (100, 32, planeFC);
  display.display();
}
// ----------------------------------------------------------------------------- main init

const byte interruptPin = 0;
volatile int interruptCounter = 0;
int numberOfInterrupts = 0;

portMUX_TYPE mux = portMUX_INITIALIZER_UNLOCKED;

void IRAM_ATTR handleInterrupt() {
  portENTER_CRITICAL_ISR(&mux);
  if (buttonPressed == 0) {
    buttonPressed = 1;
    if (displayPage >= 1) displayPage = 0;
    else displayPage++;
    //drawDisplay();
    lastDebounceTime = millis();
  }
  portEXIT_CRITICAL_ISR(&mux);
}

void setup() {
  Serial.begin(115200);
  serialConsole[0] = &Serial;
  initLogger();
  //initCli();
  initConfig();
  initDisplay();
  initLora();
  delay(1500);
  crc8.begin();
  initMSP();
  delay(1000);
  pinMode(interruptPin, INPUT);
  buttonPressed = 0;
  attachInterrupt(digitalPinToInterrupt(interruptPin), handleInterrupt, RISING);
  for (size_t i = 0; i <= 4; i++) {
    pds[i].id = 0;
  }
  booted = 1;
  serialConsole[0]->print("> ");
  // https://community.hiveeyes.org/t/esp32-multicore-task-scheduling-and-its-watchdog-timers-wdt/1554/2
  disableCore1WDT();
  disableCore0WDT();
}

// ----------------------------------------------------------------------------- main loop
void loop() {
  if ( (millis() - lastDebounceTime) > 150 && buttonPressed == 1) buttonPressed = 0;

  if (loraMode == LA_INIT && pd.id == 0) {
    loraMode = LA_PICKUP;
    pickupTime = millis();
  }

  if (loraMode == LA_PICKUP && millis() - pickupTime > cfg.loraPickupTime * 1000) {
    numPlanes = 0;
    for (size_t i = 0; i < sizeof(pds); i++) {
      if (pds[i].id == 0 && pd.id == 0) {
        pd.id = i+1;
        loraMode = LA_RX;
      }
      if (pds[i].id != 0) numPlanes++;
    }
    if (pd.id == 1 && numPlanes >= 1) sendLastTime = pds[1].lastUpdate + cfg.intervalSend - 50;
    if (pd.id > 1) currentUpdateTime = pds[pd.id-2].lastUpdate;
  }

  if (loraMode == LA_RX) {
    // ID 1
    if (pd.id == 1 && (millis() - sendLastTime) >= cfg.intervalSend) {
      loraMode = LA_TX;
      cliLog("Master TX"  + String(millis() - sendLastTime));
      sendLastTime = millis();
    }
    // ID > 1
    if (pd.id > 1 && currentUpdateTime != pds[pd.id-2].lastUpdate && millis() - pds[pd.id-2].lastUpdate >= 10) {
      loraMode = LA_TX;
      currentUpdateTime = pds[pd.id-2].lastUpdate;
      cliLog(String(pd.id) + " TX in time "  + String(millis() - sendLastTime));
      sendLastTime = millis();
    } else if (pd.id > 1 && (millis() - sendLastTime) >= cfg.intervalSend && currentUpdateTime == pds[pd.id-2].lastUpdate) {
      loraMode = LA_TX;
      cliLog(String(pd.id) + " TX no time "  + String(millis() - sendLastTime));
      sendLastTime = millis();
    }
  }

  if (displayon && millis() - displayLastTime > cfg.intervalDisplay) {
    drawDisplay();
    //readCli();
    loraTX = 0;
    loraRX = 0;
    displayLastTime = millis();
    if (pd.state == 1) displayArmed();
  }

  if (millis() - pdLastTime > cfg.intervalStatus) {
    numPlanes = 0;
    pps = ppsc;
    ppsc = 0;
    for (size_t i = 0; i <= 4; i++) {
      if (pds[i].id != 0) numPlanes++;
      //if (pd.gps.fixType != 0) pds[i].distance = distanceEarth(pd.gps.lat/10000000, pd.gps.lon/10000000, pds[i].pd.gps.lat/10000000, pds[i].pd.gps.lon/10000000);
      if (pds[i].id != 0 && millis() - pds[i].lastUpdate > cfg.uavTimeout*1000 ) { // plane timeout
        pds[i].pd.state = 2;
        //TplaneSetWP();
        pds[i].id = 0;
        rssi = "0";
        String("").toCharArray(pds[i].pd.planeName,8);
        cliLog("UAV DB delete POI #" + String(i+1));
      }
    }
    //getPlaneStatusEx();
    if (String(planeFC) == "INAV" ) {
      if (xQueueReceive(armedQ, &pd.state, (TickType_t) 0 ) == pdFALSE) cliLog("armedQ empty");
      else cliLog("armedQ got msg");
      if (xQueueReceive(batQ, &planeBat, (TickType_t) 0) == pdFALSE) cliLog("batQ empty");
      else cliLog("batQ got msg");
      if (pd.state == 0) {
        if (xQueueReceive(gpsQ, &pd.gps, (TickType_t) 0 ) == pdFALSE) cliLog("gpsQ empty");
        else cliLog("gpsQ got msg");
        if (displayon == 0) displayDisarmed();
        if (pd.gps.fixType != 0) {
          homepos = pd.gps;
        }
      }
    }
    pdLastTime = millis();
  }

  if (loraMode == LA_TX) {
    if (pd.state != 1) {
      if (pd.gps.fixType != 0) {
        homepos = pd.gps;
        sendMessage(&pd);
        loraTX = 1;
      } else {
        pd.state = 2;
        sendMessage(&pd);
        loraTX = 1;
      }
      LoRa.sleep();
      LoRa.receive();

    }

    if (pd.state == 1) {
      if (xQueueReceive(gpsQ, &pd.gps, (TickType_t) 0 ) == pdFALSE) cliLog("gpsQ empty");
      else cliLog("gpsQ got msg");
      loraTX = 1;
      if (pd.gps.fixType != 0) {
        sendMessage(&pd);
        LoRa.sleep();
        LoRa.receive();

      }
    }
    //if (pd.armState) planeSetWP();
    //if (String(planeFC) == "INAV" )
    planeSetPos();
    if (cfg.debugFakeWPs) planeFakePos();
    if (cfg.debugFakePlanes) {
      sendFakePlanes();
      LoRa.sleep();
      LoRa.receive();
      loraTX = 1;
    }
    //if (pd.id == 1) sendLastTime = millis();
    loraMode = LA_RX;

  }
  vTaskDelay(10);
}
